# Problem Set 1 Solution Template

In [27]:
import pandas as pd
import numpy as np

# mysoln is a dataframe to store your answers

# the first column of the dataframe contains names for the students in your group
# make sure these match the names shown on the pdf document provided by the MFE office
# using group 1 as an example:

mysoln = pd.DataFrame(["Jacob Yee","Chester Chen","Manish Singh", "Jessica Wu"],columns=['student'])

In [35]:
#Q1
# 1,2,3 are placeholders for a,b,c. Replace them with your answers. Do the same for Q2-Q4
APR = 0.04
CD = 200000
a = (1+APR/1)**2*CD
b = (1+APR/4)**(2*4)*CD 
c = (1+APR/12)**(2*12)*CD 

mysoln["Q1"] = [a,b,c,""]

In [36]:
#Q2
C = 0.08 * 2000000
a = C/1.05**2+C/1.05**4+C/1.05**6+C/1.05**8+C/1.05**10+C/1.05**12+C/pow(1.05,14)+C/pow(1.05,16)+C/pow(1.05,18)+C/pow(1.05,20)
b = 3000000/(1/1.06**2+1/1.06**4+1/1.06**6+1/1.06**8+1/1.06**10+1/1.06**12+1/1.06**14+1/1.06**16+1/1.06**18+1/1.06**20)
mysoln["Q2"] = [a,b,"",""]

In [37]:
#Q3
a = 0
Saving = 100000*0.45
for i in range(0,35):
    a += (Saving*(1.02)**(i))
b = a*0.02/(1-(1/1.02**20))
mysoln["Q3"] =[a,b,"",""]

In [38]:
#Q4
a = (1+0.03/12)**12-1
b = 500000*(0.03/12*(1+0.03/12)**(30*12))/((1+0.03/12)**(30*12)-1)
total_payment = 500000*1.0025**20
c = total_payment-b*((1+0.03/12)**20-1)/(0.03/12)
mysoln["Q4"]=[a,b,c,""]

In [39]:
mysoln

        student             Q2              Q3             Q4             Q1
0     Jacob Yee  972660.319418  2249751.493491       0.030416       216320.0
1  Chester Chen  538800.562117   137587.417939    2108.020169  216571.341126
2  Manish Singh                                 482425.858176  216628.591832
3    Jessica Wu